espressif/esp-idf/components/soc/esp32s31/register/soc/twaifd_struct.h
/** Type of rx_mem_info register
 *  TWAI FD rx memory information register
 */
typedef union {
    struct {
        /** rx_buff_size : RO; bitpos: [12:0]; default: 128;
         *  Size of RX buffer in 32-bit words.
         */
        uint32_t rx_buff_size:13;
        uint32_t reserved_13:3;
        /** rx_free : RO; bitpos: [28:16]; default: 128;
         *  Number of free 32 bit words in RX buffer.
         */
        uint32_t rx_free:13;
        uint32_t reserved_29:3;
    };
    uint32_t val;
} twaifd_rx_mem_info_reg_t;

/** Type of rx_pointers register
 *  TWAI FD rx memory pointer information register
 */
typedef union {
    struct {
        /** rx_wpp : RO; bitpos: [11:0]; default: 0;
         *  Write pointer position in RX buffer. Upon store of received frame write pointer is
         *  updated.
         */
        uint32_t rx_wpp:12;
        uint32_t reserved_12:4;
        /** rx_rpp : RO; bitpos: [27:16]; default: 0;
         *  Read pointer position in RX buffer. Upon read of received frame read pointer is
         *  updated.
         */
        uint32_t rx_rpp:12;
        uint32_t reserved_28:4;
    };
    uint32_t val;
} twaifd_rx_pointers_reg_t;

/** Type of rx_status_rx_settings register
 *  TWAI FD rx status & setting register
 */
typedef union {
    struct {
        /** rxe : RO; bitpos: [0]; default: 1;
         *  Represents whether or not the RX buffer is empty. RX buffer is empty. There is no
         *  CAN Frame stored in it.
         *  0: not empty
         *  1: empty
         */
        uint32_t rxe:1;
        /** rxf : RO; bitpos: [1]; default: 0;
         *  Represents whether or not the RX buffer is full. RX buffer is full, all memory
         *  words of RX buffer are occupied.
         *  0: not full
         *  1: full
         */
        uint32_t rxf:1;
        /** rxmof : RO; bitpos: [2]; default: 0;
         *  Represents the number of received frame in RX buffer.
         *  RX Buffer middle of frame. When RXMOF = 1, next read from RX_DATA register will
         *  return other than first
         *  word (FRAME_FORMAT_W) of CAN frame.
         */
        uint32_t rxmof:1;
        uint32_t reserved_3:1;
        /** rxfrc : RO; bitpos: [14:4]; default: 0;
         *  RX buffer frame count. Number of CAN frames stored in RX buffer.
         */
        uint32_t rxfrc:11;
        uint32_t reserved_15:1;
        /** rtsop : R/W; bitpos: [16]; default: 0;
         *  Receive buffer timestamp option. This register should be modified only when
         *  SETTINGS[ENA]=0.
         *  0b0 - RTS_END - Timestamp of received frame in RX FIFO is captured in last bit of
         *  EOF field.
         *  0b1 - RTS_BEG - Timestamp of received frame in RX FIFO is captured in SOF field.
         */
        uint32_t rtsop:1;
        uint32_t reserved_17:15;
    };
    uint32_t val;
} twaifd_rx_status_rx_settings_reg_t;

/** Type of tx_status register
 *  TWAI FD TX buffer status register
 */
typedef union {
    struct {
        /** txtb0_state : RO; bitpos: [3:0]; default: 8;
         *  Status of TXT buffer 1.
         *  0b0000 - TXT_NOT_EXIST - TXT buffer does not exist in the core (applies only to TXT
         *  buffers 3-8, when CTU
         *  CAN FD was synthesized with less than 8 TXT buffers).
         *  0b0001 - TXT_RDY - TXT buffer is in "Ready" state, it is waiting for CTU CAN FD to
         *  start transmission from it.
         *  0b0010 - TXT_TRAN - TXT buffer is in "TX in progress" state. CTU CAN FD is
         *  transmitting frame.
         *  0b0011 - TXT_ABTP - TXT buffer is in "Abort in progress" state.
         *  0b0100 - TXT_TOK - TXT buffer is in "TX OK" state.
         *  0b0110 - TXT_ERR - TXT buffer is in "Failed" state.
         *  0b0111 - TXT_ABT - TXT buffer is in "Aborted" state.
         *  0b1000 - TXT_ETY - TXT buffer is in "Empty" state.
         */
        uint32_t txtb0_state:4;
        /** tx2s : RO; bitpos: [7:4]; default: 8;
         *  Status of TXT buffer 2. Bit field meaning is analogous to TX1S.
         */
        uint32_t tx2s:4;
        /** tx3s : RO; bitpos: [11:8]; default: 8;
         *  Status of TXT buffer 3. Bit field meaning is analogous to TX1S.
         */
        uint32_t tx3s:4;
        /** tx4s : RO; bitpos: [15:12]; default: 8;
         *  Status of TXT buffer 4. Bit field meaning is analogous to TX1S.
         */
        uint32_t tx4s:4;
        /** tx5s : RO; bitpos: [19:16]; default: 0;
         *  Status of TXT buffer 5. Bit field meaning is analogous to TX1S.
         */
        uint32_t tx5s:4;
        /** tx6s : RO; bitpos: [23:20]; default: 0;
         *  Status of TXT buffer 6. Bit field meaning is analogous to TX1S.
         */
        uint32_t tx6s:4;
        /** tx7s : RO; bitpos: [27:24]; default: 0;
         *  Status of TXT buffer 7. Bit field meaning is analogous to TX1S.
         */
        uint32_t tx7s:4;
        /** tx8s : RO; bitpos: [31:28]; default: 0;
         *  Status of TXT buffer 8. Bit field meaning is analogous to TX1S.
         */
        uint32_t tx8s:4;
    };
    uint32_t val;
} twaifd_tx_status_reg_t;

/** Type of err_capt_retr_ctr_alc_ts_info register
 *  TWAI FD error capture & retransmit counter & arbitration lost & timestamp
 *  integration information register
 */
typedef union {
    struct {
        /** err_pos : RO; bitpos: [4:0]; default: 31;
         *  0b00000 - ERC_POS_SOF - Error in Start of Frame
         *  0b00001 - ERC_POS_ARB - Error in Arbitration Filed
         *  0b00010 - ERC_POS_CTRL - Error in Control field
         *  0b00011 - ERC_POS_DATA - Error in Data Field
         *  0b00100 - ERC_POS_CRC - Error in CRC Field
         *  0b00101 - ERC_POS_ACK - Error in CRC delimiter, ACK field or ACK delimiter
         *  0b00110 - ERC_POS_EOF - Error in End of frame field
         *  0b00111 - ERC_POS_ERR - Error during Error frame
         *  0b01000 - ERC_POS_OVRL - Error in Overload frame
         *  0b11111 - ERC_POS_OTHER - Other position of error
         */
        uint32_t err_pos:5;
        /** err_type : RO; bitpos: [7:5]; default: 0;
         *  Type of last error.
         *  0b000 - ERC_BIT_ERR - Bit Error
         *  0b001 - ERC_CRC_ERR - CRC Error
         *  0b010 - ERC_FRM_ERR - Form Error
         *  0b011 - ERC_ACK_ERR - Acknowledge Error
         *  0b100 - ERC_STUF_ERR - Stuff Error
         */
        uint32_t err_type:3;
        /** retr_ctr_val : RO; bitpos: [11:8]; default: 0;
         *  Current value of retransmitt counter.
         */
        uint32_t retr_ctr_val:4;
        uint32_t reserved_12:4;
        /** alc_bit : RO; bitpos: [20:16]; default: 0;
         *  Arbitration lost capture bit position. If ALC_ID_FIELD = ALC_BASE_ID then bit index
         *  of BASE identifier
         *  in which arbitration was lost is given as: 11 - ALC_VAL. If ALC_ID_FIELD =
         *  ALC_EXTENSION then bit index of
         *  EXTENDED identifier in which arbitration was lost is given as: 18 - ALC_VAL. For
         *  other values of ALC_ID_FIELD,
         *  this value is undefined.
         */
        uint32_t alc_bit:5;
        /** alc_id_field : RO; bitpos: [23:21]; default: 0;
         *  Part of CAN Identifier in which arbitration was lost.
         *  0b000 - ALC_RSVD - Unit did not loose arbitration since last reset.
         *  0b001 - ALC_BASE_ID - Arbitration was lost during base identifier.
         *  0b010 - ALC_SRR_RTR - Arbitration was lost during first bit after base identifier
         *  (SRR of Extended Frame, RTR
         *  bit of CAN 2.0 Base Frame)
         *  0b011 - ALC_IDE - Arbitration was lost during IDE bit.
         *  0b100 - ALC_EXTENSION - Arbitration was lost during Identifier extension.
         *  0b101 - ALC_RTR - Arbitration was lost during RTR bit after Identifier extension!
         */
        uint32_t alc_id_field:3;
        /** ts_bits : RO; bitpos: [29:24]; default: 0;
         *  Number of active bits of CTU CAN FD time-base minus 1 (0x3F = 64 bit time-base).
         */
        uint32_t ts_bits:6;
        uint32_t reserved_30:2;
    };
    uint32_t val;
} twaifd_err_capt_retr_ctr_alc_ts_info_reg_t;

/** Type of yolo register
 *  TWAI FD transmitted frame counter register
 */
typedef union {
    struct {
        /** yolo_val : RO; bitpos: [31:0]; default: 3735928559;
         *  What else could be in this register??
         */
        uint32_t yolo_val:32;
    };
    uint32_t val;
} twaifd_yolo_reg_t;

