espressif/esp-idf/components/soc/esp32s31/register/soc/twaifd_struct.h
/** Type of timestamp_low register
 *  TWAI FD transmitted frame counter register
 */
typedef union {
    struct {
        /** timestamp_low : RO; bitpos: [31:0]; default: 0;
         *  Bits 31:0 of time base.
         */
        uint32_t timestamp_low:32;
    };
    uint32_t val;
} twaifd_timestamp_low_reg_t;

/** Type of timestamp_high register
 *  TWAI FD transmitted frame counter register
 */
typedef union {
    struct {
        /** timestamp_high : RO; bitpos: [31:0]; default: 0;
         *  Bits 63:32 of time base.
         */
        uint32_t timestamp_high:32;
    };
    uint32_t val;
} twaifd_timestamp_high_reg_t;


/** Group: interrupt register */
/** Type of int_ena_set register
 *  TWAI FD interrupt enable register
 */
typedef union {
    struct {
        /** rxi_int_ena_mask : R/W1S; bitpos: [0]; default: 0;
         *  Write 1 to enable TWAIFD_RXI_INT.
         */
        uint32_t rxi_int_ena_mask:1;
        /** txi_int_ena_mask : R/W1S; bitpos: [1]; default: 0;
         *  Write 1 to enable TWAIFD_TXI_INT.
         */
        uint32_t txi_int_ena_mask:1;
        /** ewli_int_ena_mask : R/W1S; bitpos: [2]; default: 0;
         *  Write 1 to enable TWAIFD_EWLI_INT.
         */
        uint32_t ewli_int_ena_mask:1;
        /** doi_int_ena_mask : R/W1S; bitpos: [3]; default: 0;
         *  Write 1 to enable TWAIFD_DOI_INT.
         */
        uint32_t doi_int_ena_mask:1;
        /** fcsi_int_ena_mask : R/W1S; bitpos: [4]; default: 0;
         *  Write 1 to enable TWAIFD_FCSI_INT.
         */
        uint32_t fcsi_int_ena_mask:1;
        /** ali_int_ena_mask : R/W1S; bitpos: [5]; default: 0;
         *  Write 1 to enable TWAIFD_ALI_INT.
         */
        uint32_t ali_int_ena_mask:1;
        /** bei_int_ena_mask : R/W1S; bitpos: [6]; default: 0;
         *  Write 1 to enable TWAIFD_BEI_INT.
         */
        uint32_t bei_int_ena_mask:1;
        /** ofi_int_ena_mask : R/W1S; bitpos: [7]; default: 0;
         *  Write 1 to enable TWAIFD_OFI_INT.
         */
        uint32_t ofi_int_ena_mask:1;
        /** rxfi_int_ena_mask : R/W1S; bitpos: [8]; default: 0;
         *  Write 1 to enable TWAIFD_RXFI_INT.
         */
        uint32_t rxfi_int_ena_mask:1;
        /** bsi_int_ena_mask : R/W1S; bitpos: [9]; default: 0;
         *  Write 1 to enable TWAIFD_BSI_INT.
         */
        uint32_t bsi_int_ena_mask:1;
        /** rbnei_int_ena_mask : R/W1S; bitpos: [10]; default: 0;
         *  Write 1 to enable TWAIFD_RBNEI_INT.
         */
        uint32_t rbnei_int_ena_mask:1;
        /** txbhci_int_ena_mask : R/W1S; bitpos: [11]; default: 0;
         *  Write 1 to enable TWAIFD_TXBHCI_INT.
         */
        uint32_t txbhci_int_ena_mask:1;
        uint32_t reserved_12:20;
    };
    uint32_t val;
} twaifd_int_ena_set_reg_t;

/** Type of int_ena_clr register
 *  TWAI FD interrupt enable clear register
 */
typedef union {
    struct {
        /** rxi_int_ena_clr : WO; bitpos: [0]; default: 0;
         *  Write 1 to clear TWAIFD_RXI_INT_ENA .
         */
        uint32_t rxi_int_ena_clr:1;
        /** txi_int_ena_clr : WO; bitpos: [1]; default: 0;
         *  Write 1 to clear TWAIFD_TXI_INT_ENA .
         */
        uint32_t txi_int_ena_clr:1;
        /** ewli_int_ena_clr : WO; bitpos: [2]; default: 0;
         *  Write 1 to clear TWAIFD_EWLI_INT_ENA .
         */
        uint32_t ewli_int_ena_clr:1;
        /** doi_int_ena_clr : WO; bitpos: [3]; default: 0;
         *  Write 1 to clear TWAIFD_DOI_INT_ENA .
         */
        uint32_t doi_int_ena_clr:1;
        /** fcsi_int_ena_clr : WO; bitpos: [4]; default: 0;
         *  Write 1 to clear TWAIFD_FCSI_INT_ENA .
         */
        uint32_t fcsi_int_ena_clr:1;
        /** ali_int_ena_clr : WO; bitpos: [5]; default: 0;
         *  Write 1 to clear TWAIFD_ALI_INT_ENA .
         */
        uint32_t ali_int_ena_clr:1;
        /** bei_int_ena_clr : WO; bitpos: [6]; default: 0;
         *  Write 1 to clear TWAIFD_BEI_INT_ENA .
         */
        uint32_t bei_int_ena_clr:1;
        /** ofi_int_ena_clr : WO; bitpos: [7]; default: 0;
         *  Write 1 to clear TWAIFD_OFI_INT_ENA .
         */
        uint32_t ofi_int_ena_clr:1;
        /** rxfi_int_ena_clr : WO; bitpos: [8]; default: 0;
         *  Write 1 to clear TWAIFD_RXFI_INT_ENA .
         */
        uint32_t rxfi_int_ena_clr:1;
        /** bsi_int_ena_clr : WO; bitpos: [9]; default: 0;
         *  Write 1 to clear TWAIFD_BSI_INT_ENA .
         */
        uint32_t bsi_int_ena_clr:1;
        /** rbnei_int_ena_clr : WO; bitpos: [10]; default: 0;
         *  Write 1 to clear TWAIFD_RBNEI_INT_ENA .
         */
        uint32_t rbnei_int_ena_clr:1;
        /** txbhci_int_ena_clr : WO; bitpos: [11]; default: 0;
         *  Write 1 to clear TWAIFD_TXBHCI_INT_ENA .
         */
        uint32_t txbhci_int_ena_clr:1;
        uint32_t reserved_12:20;
    };
    uint32_t val;
} twaifd_int_ena_clr_reg_t;

/** Type of int_mask_set register
 *  TWAI FD interrupt mask register
 */
typedef union {
    struct {
        /** rxi_int_mask_set : R/W1S; bitpos: [0]; default: 0;
         *  Write 1 to mask TWAIFD_RXI_INT.
         */
        uint32_t rxi_int_mask_set:1;
        /** txi_int_mask_set : R/W1S; bitpos: [1]; default: 0;
         *  Write 1 to mask TWAIFD_TXI_INT.
         */
        uint32_t txi_int_mask_set:1;
        /** ewli_int_mask_set : R/W1S; bitpos: [2]; default: 0;
         *  Write 1 to mask TWAIFD_EWLI_INT.
         */
        uint32_t ewli_int_mask_set:1;
        /** doi_int_mask_set : R/W1S; bitpos: [3]; default: 0;
         *  Write 1 to mask TWAIFD_DOI_INT.
         */
        uint32_t doi_int_mask_set:1;
        /** fcsi_int_mask_set : R/W1S; bitpos: [4]; default: 0;
         *  Write 1 to mask TWAIFD_FCSI_INT.
         */
        uint32_t fcsi_int_mask_set:1;
        /** ali_int_mask_set : R/W1S; bitpos: [5]; default: 0;
         *  Write 1 to mask TWAIFD_ALI_INT.
         */
        uint32_t ali_int_mask_set:1;
        /** bei_int_mask_set : R/W1S; bitpos: [6]; default: 0;
         *  Write 1 to mask TWAIFD_BEI_INT.
         */
        uint32_t bei_int_mask_set:1;
        /** ofi_int_mask_set : R/W1S; bitpos: [7]; default: 0;
         *  Write 1 to mask TWAIFD_OFI_INT.
         */
        uint32_t ofi_int_mask_set:1;
        /** rxfi_int_mask_set : R/W1S; bitpos: [8]; default: 0;
         *  Write 1 to mask TWAIFD_RXFI_INT.
         */
        uint32_t rxfi_int_mask_set:1;
        /** bsi_int_mask_set : R/W1S; bitpos: [9]; default: 0;
         *  Write 1 to mask TWAIFD_BSI_INT.
         */
        uint32_t bsi_int_mask_set:1;
        /** rbnei_int_mask_set : R/W1S; bitpos: [10]; default: 0;
         *  Write 1 to mask TWAIFD_RBNEI_INT.
         */
        uint32_t rbnei_int_mask_set:1;
        /** txbhci_int_mask_set : R/W1S; bitpos: [11]; default: 0;
         *  Write 1 to mask TWAIFD_TXBHCI_INT.
         */
        uint32_t txbhci_int_mask_set:1;
        uint32_t reserved_12:20;
    };
    uint32_t val;
} twaifd_int_mask_set_reg_t;

