espressif/esp-idf/components/soc/esp32s31/register/soc/twaifd_struct.h
/** TWAI bits filter register
 */
typedef struct {
    volatile twaifd_filter_mask_reg_t filter_mask;
    volatile twaifd_filter_val_reg_t  filter_val;
} twaifd_mask_filter_reg_t;

/** TWAI range filter register
 */
typedef struct {
    volatile twaifd_filter_ran_low_reg_t ran_low;
    volatile twaifd_filter_ran_high_reg_t ran_high;
} twaifd_range_filter_reg_t;

/**
 * @brief TWAI frame buffer register types
 */
typedef union twaifd_frame_buffer_t {
    struct {
        union {
            struct {
                uint32_t dlc: 4;            // Data length code (0-15)
                uint32_t reserved4: 1;      // Reserved bit
                uint32_t rtr: 1;            // Remote transmission request. Note there are no remote frames in CAN FD protocol
                uint32_t ide: 1;            // Identifier extension bit
                uint32_t fdf: 1;            // Flexible data-rate format bit
                uint32_t reserved8: 1;      // Reserved bit
                uint32_t brs: 1;            // Bit rate switch flag
                uint32_t esi: 1;            // Error state indicator
                uint32_t rwcnt: 5;          // Re-transmission counter
                uint32_t reserved16: 16;    // Reserved bits
            };
            uint32_t val;                   // Complete 32-bit register value for format
        } format;

        union {
            struct {
                uint32_t identifier_ext: 18;  // Extended identifier (18 bits)
                uint32_t identifier_base: 11; // Base identifier (11 bits)
                uint32_t reserved29: 3;       // Reserved bits
            };
            uint32_t val;                     // Complete 32-bit register value for identifier
        } identifier;

        uint32_t timestamp_low;               // Lower 32 bits of timestamp
        uint32_t timestamp_high;              // Upper 32 bits of timestamp
        uint32_t data[16];                    // Data payload (16 words)
    };
    uint32_t words[20];                       // Raw 32-bit words for direct access
} twaifd_frame_buffer_t;

/** TWAI frame txt buffer registers
 */
typedef struct {
    volatile twaifd_frame_buffer_t txt_buffer;
    uint32_t reserved_50[44];
} twaifd_frame_mem_t;


typedef struct twaifd_dev_t {
    volatile twaifd_device_id_version_reg_t device_id_version;
    volatile twaifd_mode_settings_reg_t mode_settings;
    volatile twaifd_status_reg_t status;
    volatile twaifd_command_reg_t command;
    volatile twaifd_int_stat_reg_t int_stat;
    volatile twaifd_int_ena_set_reg_t int_ena_set;
    volatile twaifd_int_ena_clr_reg_t int_ena_clr;
    volatile twaifd_int_mask_set_reg_t int_mask_set;
    volatile twaifd_int_mask_clr_reg_t int_mask_clr;
    volatile twaifd_btr_reg_t btr;
    volatile twaifd_btr_fd_reg_t btr_fd;
    volatile twaifd_ewl_erp_fault_state_reg_t ewl_erp_fault_state;
    volatile twaifd_rec_tec_reg_t rec_tec;
    volatile twaifd_err_norm_err_fd_reg_t err_norm_err_fd;
    volatile twaifd_ctr_pres_reg_t ctr_pres;
    volatile twaifd_mask_filter_reg_t mask_filters[3];
    volatile twaifd_range_filter_reg_t range_filters[1];
    volatile twaifd_filter_control_filter_status_reg_t filter_control_filter_status;
    volatile twaifd_rx_mem_info_reg_t rx_mem_info;
    volatile twaifd_rx_pointers_reg_t rx_pointers;
    volatile twaifd_rx_status_rx_settings_reg_t rx_status_rx_settings;
    volatile twaifd_rx_data_reg_t rx_data;
    volatile twaifd_tx_status_reg_t tx_status;
    volatile twaifd_tx_command_txtb_info_reg_t tx_command_txtb_info;
    volatile twaifd_tx_priority_reg_t tx_priority;
    volatile twaifd_err_capt_retr_ctr_alc_ts_info_reg_t err_capt_retr_ctr_alc_ts_info;
    volatile twaifd_trv_delay_ssp_cfg_reg_t trv_delay_ssp_cfg;
    volatile twaifd_rx_fr_ctr_reg_t rx_fr_ctr;
    volatile twaifd_tx_fr_ctr_reg_t tx_fr_ctr;
    volatile twaifd_debug_reg_t debug;
    volatile twaifd_yolo_reg_t yolo;
    volatile twaifd_timestamp_low_reg_t timestamp_low;
    volatile twaifd_timestamp_high_reg_t timestamp_high;
    uint32_t reserved_09c[25];
    volatile twaifd_frame_mem_t txt_mem_cell[8]; // only 4 are actively used
    uint32_t reserved_900[437];
    volatile twaifd_timer_clk_en_reg_t timer_clk_en;
    volatile twaifd_timer_int_raw_reg_t timer_int_raw;
    volatile twaifd_timer_int_st_reg_t timer_int_st;
    volatile twaifd_timer_int_ena_reg_t timer_int_ena;
    volatile twaifd_timer_int_clr_reg_t timer_int_clr;
    volatile twaifd_timer_cfg_reg_t timer_cfg;
    volatile twaifd_timer_ld_val_l_reg_t timer_ld_val_l;
    volatile twaifd_timer_ld_val_h_reg_t timer_ld_val_h;
    volatile twaifd_timer_ct_val_l_reg_t timer_ct_val_l;
    volatile twaifd_timer_ct_val_h_reg_t timer_ct_val_h;
    volatile twaifd_date_ver_reg_t date_ver;
} twaifd_dev_t;

extern twaifd_dev_t TWAIFD0;
extern twaifd_dev_t TWAIFD1;


#ifndef __cplusplus
_Static_assert(sizeof(twaifd_dev_t) == 0x1000, "Invalid size of twaifd_dev_t structure");
#endif

#ifdef __cplusplus
}
#endif
